results/rest/stage-50/payload-heavy/200VUs/repeat-1/200vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-50/payload-heavy/200VUs/repeat-1/200vus.json)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 200 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 355 complete and 0 interrupted iterations
default   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 895 complete and 0 interrupted iterations
default   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 1463 complete and 0 interrupted iterations
default   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 2052 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m04.1s), 200/200 VUs, 2647 complete and 0 interrupted iterations
default   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m05.1s), 200/200 VUs, 3255 complete and 0 interrupted iterations
default   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m06.1s), 200/200 VUs, 3854 complete and 0 interrupted iterations
default   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m07.1s), 200/200 VUs, 4475 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m08.1s), 200/200 VUs, 5065 complete and 0 interrupted iterations
default   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m09.1s), 200/200 VUs, 5666 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m10.1s), 200/200 VUs, 6280 complete and 0 interrupted iterations
default   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m11.1s), 200/200 VUs, 6895 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m12.1s), 200/200 VUs, 7488 complete and 0 interrupted iterations
default   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m13.1s), 200/200 VUs, 8102 complete and 0 interrupted iterations
default   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m14.1s), 200/200 VUs, 8726 complete and 0 interrupted iterations
default   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m15.1s), 200/200 VUs, 9331 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m16.1s), 200/200 VUs, 9952 complete and 0 interrupted iterations
default   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m17.1s), 200/200 VUs, 10567 complete and 0 interrupted iterations
default   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m18.1s), 200/200 VUs, 11154 complete and 0 interrupted iterations
default   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m19.1s), 200/200 VUs, 11766 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m20.1s), 200/200 VUs, 12356 complete and 0 interrupted iterations
default   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m21.1s), 200/200 VUs, 12964 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m22.1s), 200/200 VUs, 13574 complete and 0 interrupted iterations
default   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m23.1s), 200/200 VUs, 14177 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m24.1s), 200/200 VUs, 14793 complete and 0 interrupted iterations
default   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m25.1s), 200/200 VUs, 15405 complete and 0 interrupted iterations
default   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m26.1s), 200/200 VUs, 16024 complete and 0 interrupted iterations
default   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m27.1s), 200/200 VUs, 16641 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m28.1s), 200/200 VUs, 17263 complete and 0 interrupted iterations
default   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m29.1s), 200/200 VUs, 17878 complete and 0 interrupted iterations
default   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m30.1s), 200/200 VUs, 18492 complete and 0 interrupted iterations
default   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m31.1s), 200/200 VUs, 19120 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m32.1s), 200/200 VUs, 19742 complete and 0 interrupted iterations
default   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m33.1s), 200/200 VUs, 20356 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m33.4s), 200/200 VUs, 20988 complete and 0 interrupted iterations
default   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m34.4s), 200/200 VUs, 21617 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m35.4s), 200/200 VUs, 22235 complete and 0 interrupted iterations
default   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m36.4s), 200/200 VUs, 22866 complete and 0 interrupted iterations
default   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m37.4s), 200/200 VUs, 23507 complete and 0 interrupted iterations
default   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m38.4s), 200/200 VUs, 24118 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m39.4s), 200/200 VUs, 24755 complete and 0 interrupted iterations
default   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m40.4s), 200/200 VUs, 25381 complete and 0 interrupted iterations
default   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m41.4s), 200/200 VUs, 26027 complete and 0 interrupted iterations
default   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m42.4s), 200/200 VUs, 26655 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m43.4s), 200/200 VUs, 27290 complete and 0 interrupted iterations
default   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m44.4s), 200/200 VUs, 27922 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m45.4s), 200/200 VUs, 28554 complete and 0 interrupted iterations
default   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m46.4s), 200/200 VUs, 29180 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m47.4s), 200/200 VUs, 29809 complete and 0 interrupted iterations
default   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m48.4s), 200/200 VUs, 30429 complete and 0 interrupted iterations
default   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m49.4s), 200/200 VUs, 31066 complete and 0 interrupted iterations
default   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m50.4s), 200/200 VUs, 31683 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m51.4s), 200/200 VUs, 32317 complete and 0 interrupted iterations
default   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m52.4s), 200/200 VUs, 32953 complete and 0 interrupted iterations
default   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m53.4s), 200/200 VUs, 33593 complete and 0 interrupted iterations
default   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m54.4s), 200/200 VUs, 34222 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m55.4s), 200/200 VUs, 34855 complete and 0 interrupted iterations
default   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m56.4s), 200/200 VUs, 35499 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m57.4s), 200/200 VUs, 36123 complete and 0 interrupted iterations
default   [  98% ] 200 VUs  0m59.0s/1m0s

running (0m58.4s), 200/200 VUs, 36751 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.15%  56 out of 36965
    benchmark_total_failure_rate...: 0.15%  56 out of 36965

    HTTP
    http_req_duration..............: avg=318.75ms min=-302682473ns med=321.44ms max=2.22s p(90)=336.76ms p(95)=342.63ms
      { expected_response:true }...: avg=318.75ms min=-302682473ns med=321.44ms max=2.22s p(90)=336.76ms p(95)=342.63ms
    http_req_failed................: 0.00%  0 out of 36965
    http_reqs......................: 36965  630.65189/s

    EXECUTION
    iteration_duration.............: avg=325.2ms  min=225.76ms     med=322.09ms max=2.23s p(90)=337.18ms p(95)=342.95ms
    iterations.....................: 36965  630.65189/s
    vus............................: 200    min=200         max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 9.2 MB 157 kB/s
    data_sent......................: 1.2 GB 21 MB/s



running (0m58.6s), 000/200 VUs, 36965 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  1m0s